charmmmz/picpak-tesserae-client/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# GPIO21 is the on-board status LED AND the UART0 TX pin. Route the console to
# the native USB-Serial-JTAG only (where logs are already read — the
# /dev/cu.usbmodem* port), so UART0 no longer drives GPIO21 and the LED blinks
# cleanly with no boot/log flicker. Serial monitoring is unchanged (it was
# already the USB-JTAG secondary console); UART0 output went nowhere but the LED.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# PicPak power is marginal: WiFi radio current spikes dip Vdd into brownout.
# Keep the brownout detector ON (safety), but buy headroom by running the CPU at
# 80 MHz (much lower baseline current; WiFi works fine) and use the most tolerant
# brownout threshold so brief transients don't trigger a reset.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80=y
CONFIG_ESP_BROWNOUT_DET=y
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y
# Low-power WiFi profile for the marginal PicPak rail.
# Cap PHY TX power at BUILD time: this governs the init/calibration current
# spike (the `enable_tsf` brownout moment), which the runtime
# esp_wifi_set_max_tx_power() does NOT reach. 8 dBm still connects at normal
# home range. (10 dBm is the minimum this setting allows.)
CONFIG_ESP_PHY_MAX_WIFI_TX_POWER=10
# Trim the WiFi subsystem footprint (a 30 KB fetch needs very little).
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=8
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n
# Captive-portal HTTP server: the ESP-IDF default request-header cap is 512 bytes,
# which a normal browser overruns once it carries cookies for 192.168.4.1 (the
# form then fails with HTTP 431 "Header fields are too long"; incognito, having no
# cookies, fits and works). Raise the cap so a cookie-laden setup POST is accepted.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=1024
# Cloud-relay frame-key derivation: HKDF-SHA256 (RFC 5869). GCM/ECDH/Curve25519
# are already on; only HKDF was missing. See relay_crypto.c.
CONFIG_MBEDTLS_HKDF_C=y

# Physically opened, five-minute Companion maintenance sessions only.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=1
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_SM_LEGACY=n
CONFIG_BT_NIMBLE_SM_SC_ONLY=1
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=256
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=8192
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
